#+TITLE: Poly Computing environment

*** Comment le programme utilise les arguments

 Faire des expériences avec le programme suivant:

 #+BEGIN_SRC c
   #include <stdio.h>

   int main(int argc, char **argv)
   {
           for(int i = 0; i < argc; i++){
                   printf("argv[%d] = %s\n", i, argv[i]);
           }
   }
 #+END_SRC

 qu'on peut compiler avec la commande
 #+BEGIN_SRC sh
 gcc mon_programme.c -std=c99
 #+END_SRC

 Et maintenant, on peut faire des expériences avec ce programme pour comprendre
 comment les arguments d'une commande sont vus par le programme qui les reçoit.

 #+BEGIN_SRC sh :results output :exports both
 ./a.out un_mot un_autre_mot 'Single quotes' "Double quotes"
 #+END_SRC

 #+RESULTS:
 : argv[0] = ./a.out
 : argv[1] = un_mot
 : argv[2] = un_autre_mot

 Les guillemets regroupent empêchent les espaces de briser des mots.  Dans les
 guillemets doubles, les variables sont évaluées et dans les guillemets simples
 elles ne le sont pas.

 #+BEGIN_SRC sh :results output :exports both
 ma_variable=valeur_de_ma_variable
 ./a.out "Ma variable vaut $ma_variable" 'Des variables ne sont pas évaluées dans les guillemets simples : $ma_variable'
 #+END_SRC

 #+RESULTS:
 : argv[0] = ./a.out
 : argv[1] = Ma variable vaut valeur_de_ma_variable
 : argv[2] = Des variables ne sont pas évaluées dans les guillemets simples : $ma_variable

 Il en va de même pour l'opérateur signe-de-piastre-parentheses^*:
 #+BEGIN_SRC sh :results output :exports both
 ./a.out "La date est $(date)"
 #+END_SRC

 #+RESULTS:
 : argv[0] = ./a.out
 : argv[1] = La date est Sun Nov 11 23:33:00 EST 2018

 #+BEGIN_SRC sh :results output :exports both
 ./a.out 'La date est $(date)'
 #+END_SRC

 #+RESULTS:
 : argv[0] = ./a.out
 : argv[1] = La date est $(date)

 Regardez la différence que fait les guillements:
 #+BEGIN_SRC sh :results output :exports both
 ./a.out $(date)
 #+END_SRC

 #+RESULTS:
 : argv[0] = ./a.out
 : argv[1] = Sun
 : argv[2] = Nov
 : argv[3] = 11
 : argv[4] = 23:49:36
 : argv[5] = EST
 : argv[6] = 2018

 et

 #+BEGIN_SRC sh :results output :exports both
 ./a.out "$(date)"
 #+END_SRC

 #+RESULTS:
 : argv[0] = ./a.out
 : argv[1] = Sun Nov 11 23:50:08 EST 2018

 On voit que le singe de piastre est évalué et le résultat est passé au
 programme.  Ce n'est pas le programme appelé qui reçoit "$(date)" et l'évalue.

 .^* Je dis vraiment "signe de piastre parentheses" ou "dollar sign parenthese"
 quand je parle en français.

*** Arguments python
Le module sys nous donne une liste argv contenant les mots de la ligne de commande
#+BEGIN_SRC python :results output
import sys

nb_arguments = len(sys.argv)
i = 0
for argument in sys.argv:
    print("Argument {} = {}".format(i, argument))
    i += 1
#+END_SRC

#+RESULTS:
: Argument 0 = 


** Grep and environment
#+BEGIN_SRC sh :results output
env | grep TERM
#+END_SRC

#+RESULTS:
: TERM_PROGRAM=iTerm.app
: TERM_PROGRAM_VERSION=3.2.6beta3
: TERM_SESSION_ID=w0t0p0:AD7E7746-4D43-438A-B61C-598A30332562
: ITERM_PROFILE=Hotkey Window
: ITERM_SESSION_ID=w0t0p0:AD7E7746-4D43-438A-B61C-598A30332562
: COLORTERM=truecolor


